Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
quirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/customMessageLambdaTrigger",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          + "timestamp" = "1750239459645683000"
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/cognito-logEmailDelivery"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito-logEmailDelivery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "cognito-logEmailDelivery-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-logEmailDelivery"
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Logging of user invite email delivery status."
      + filename                       = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip"
      + function_name                  = "cognito-logEmailDelivery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "cognito/lambda/logEmailDelivery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip"
          + "timestamp" = "1750239459833080000"
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/cognito-sendClinicJobEmail"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito-sendClinicJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "cognito-sendClinicJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-sendClinicJobEmail"
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "cognito-sendClinicJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-sendClinicJobEmail"
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Sends clinic status emails"
      + filename                       = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
      + function_name                  = "cognito-sendClinicJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUI_SSM_PARAM_NAME"  = "bui-ssm-beacon-ui-url"
              + "SES_CONFIG_SET_NAME" = "ses-feedback-config"
              + "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendClinicJobEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendClinicJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
          + "timestamp" = "1750239459728293000"
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/cognito-sendRegistrationEmail"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito-sendRegistrationEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "cognito-sendRegistrationEmail-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-sendRegistrationEmail"
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "cognito-sendRegistrationEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-sendRegistrationEmail"
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Sends registration email on user account creation"
      + filename                       = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
      + function_name                  = "cognito-sendRegistrationEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUI_SSM_PARAM_NAME"  = "bui-ssm-beacon-ui-url"
              + "SES_CONFIG_SET_NAME" = "ses-feedback-config"
              + "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendRegistrationEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendRegistrationEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
          + "timestamp" = "1750239459646055000"
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "svep-qcfigures-lambda-containers"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = (known after apply)
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "556ca3fbdd2802f760b81c448fe363262b1724dd"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this will be created
  + resource "docker_registry_image" "this" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = (known after apply)
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha" = "556ca3fbdd2802f760b81c448fe363262b1724dd"
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-qcFigures"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-qcFigures"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-qcFigures-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-qcFigures"
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-qcFigures-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-qcFigures"
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.pipeline_lookup will be created
  + resource "aws_api_gateway_resource" "pipeline_lookup" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pipeline_lookup"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "results"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "submit"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_rule.update_references_trigger will be created
  + resource "aws_cloudwatch_event_rule" "update_references_trigger" {
      + arn                 = (known after apply)
      + description         = "A scheduled trigger that checks for changes to and updates reference files used by PGxFlow's PharmCAT pipeline."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "lookup_update_references_trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags_all            = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_target.update_references_trigger will be created
  + resource "aws_cloudwatch_event_target" "update_references_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "lookup_update_references_trigger"
      + target_id      = "lambda-lookup-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIGetResultsURL will be created
  + resource "aws_lambda_permission" "APIGetResultsURL" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-lookup-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetResultsURLInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.pipeline_pharmcat will be created
  + resource "aws_api_gateway_resource" "pipeline_pharmcat" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pipeline_pharmcat"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "results"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "submit"
      + rest_api_id = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_rule.update_references_trigger will be created
  + resource "aws_cloudwatch_event_rule" "update_references_trigger" {
      + arn                 = (known after apply)
      + description         = "A scheduled trigger that checks for changes to and updates reference files used by PGxFlow's PharmCAT pipeline."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "pharmcat_update_references_trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags_all            = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_target.update_references_trigger will be created
  + resource "aws_cloudwatch_event_target" "update_references_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "pharmcat_update_references_trigger"
      + target_id      = "lambda-pharmcat-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIGetResultsURL will be created
  + resource "aws_lambda_permission" "APIGetResultsURL" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-pharmcat-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetResultsURLInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/pgxflow.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default"
                  + module = ".terraform/modules/pgxflow.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"pgxflow/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python libraries"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "pgxflow_backend_python_libraries_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = (known after apply)
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = (known after apply)
          + "timestamp" = (known after apply)
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python modules"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "pgxflow_backend_python_modules_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip"
          + "timestamp" = "1750239459825403000"
        }
    }

  # module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + content_handling     = "CONVERT_TO_TEXT"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-admin-proxy.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + res
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.